[
  {
    "name": "Odi's Relentlessness",
    "type": "armour",
    "existing": [
      {
        "value": "Whenever you make an investigation check, you may spend a minute to also make a religion check and use the higher of the two results.",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+1 intelligence"
      },
      {
        "value": "+1 to all saving throws if you have made an investigation check in the last minute"
      },
      {
        "value": "You can spend an action making an investigation or perception check to ensure your next two attacks in this encounter are guaranteed to be critical hits.",
        "upgradeable": false
      },
      {
        "value": "You have advantage on checks to learn creature stats",
        "upgradeable": false
      },
      {
        "value": "When learning creature stats, you can sacrifice a question. If you do this, you and your allies deal +1 damage with all spells and attacks against that creature. This does not stack."
      },
      {
        "value": "You can make a disadvantaged check (of any appropriate type) to learn creature stats at the start of an encounter as a free action",
        "comment": "-> No disadvantage -> advantage"
      },
      {
        "value": "You have +1 AC when a creature targets you with an attack it has already used against you.",
        "comment": "+1 AC, max 2 AC"
      },
      {
        "value": "Whenever a creature succeeds a save against one of your spells, you learn its spell save bonus for all attributes",
        "upgradeable": false
      },
      {
        "value": "Once you have seen a creature cast a spell, you can spend an action to force it to make an Intelligence save against a DC of 8 + your prof + your INT Mod. On a failed save, the creature can't use that spell again for a minute, and you become able to use it once with Intelligence as the casting modifier.",
        "upgradeable": false
      }
    ],
    "found": false,
    "level": 1
  },
  {
    "name": "Thatar's Soulthirst",
    "type": "weapon",
    "existing": [
      {
        "value": "You have advantage on attacks that would deal necrotic damage",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "When you kill a humanoid with an attack or spell, it rises at the start of your next turn as a zombie that is permanently under your command, following your verbal orders to the best of its ability. You may only have 1 such zombie at any given time.",
        "comment": "Ogre zombies instead"
      },
      {
        "value": "+1d4 necrotic damage with attacks with this weapon",
        "comment": "-> 1d6 -> 1d8 -> etc"
      },
      {
        "value": "You are resistant to necrotic damage",
        "upgradeable": false
      },
      {
        "value": "+3 resistance to damage from undead creatures",
        "comment": "+1"
      },
      {
        "value": "You learn the Finger of Death spell and may cast it once per long rest. Casting mod is a mental attribute of your choice.",
        "upgradeable": false
      },
      {
        "value": "Once per long rest, when you kill a creature, you can choose to reanimate it for 1 round. While reanimated in this way, the creature cannot die, and it is completely under your control.",
        "comment": "+1 round"
      },
      {
        "value": "Once per long rest, you may cast 1 spell slot worth of Necromany spells for without consuming a spell slot (you must still know the spell).",
        "comment": "When upgraded, can be used to cast 2x level 1 or 1x level 2, etc."
      },
      {
        "value": "For every effect that would target you, you may choose to be considered undead instead of humanoid",
        "upgradeable": false
      },
      {
        "value": "Once per long rest, when killing a creature on your turn, you may immediately take another turn.",
        "comment": "More uses"
      }
    ],
    "found": false,
    "level": 1
  },
  {
    "name": "Rislog's Ferocity",
    "type": "weapon",
    "existing": [
      {
        "value": "Attacks with this weapon cannot be disadvantaged",
        "upgradeable": false
      },
      {
        "value": "+2 weapon die size",
        "upgradeable": false
      },
      {
        "value": "+1 damage to melee and touch attacks"
      },
      {
        "value": "+1d4 piercing damage with attacks with this weapon"
      },
      {
        "value": "If this weapon is a melee weapon, it is considered to have reach.",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "You may cast Wrathful Smite as a free action once per short rest. DC = 8 + AB for the attack that applied it.",
        "comment": "+1 uses per short rest"
      },
      {
        "value": "You and allies within 20 feet cannot be frightened if you have hit an enemy with this weapon in the last 2 rounds",
        "comment": "+5 feet, +1 round"
      },
      {
        "value": "If you are wielding a shield and have taken the attack action on your turn, you may make a bonus action to hit your target with your shield. They make a Strength saving throw against a DC of 8 + your prof + your STR Mod and are knocked prone on a failed save.",
        "upgradeable": false
      },
      {
        "value": "You may wield any weapon as if it were a light weapon, and you have proficiency with all weapons.",
        "upgradeable": false
      },
      {
        "value": "+4 damage against frightened enemies",
        "comment": "+3"
      },
      {
        "value": "+2 to saves and checks against non-magical grapples and restrains, including getting out from existing ones",
        "comment": "+1"
      },
      {
        "value": "Allies within 5 feet of your have +1 global damage"
      },
      {
        "value": "When you hit an enemy with more than one attack in a turn, you may also shove that target as a free action. You can do this [prof mod] times per long rest.",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 5,
    "enabled": true
  },
  {
    "name": "Cerasil's Protection",
    "type": "armour",
    "existing": [
      {
        "value": "+2 damage resistance while in sunlight",
        "comment": "+1"
      },
      {
        "value": "You are permanently under the effect of the Speak with Animals spell",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "You may cast Animal Shapes once per long rest",
        "upgradeable": false
      },
      {
        "value": "You may cast Conjure Animal once per short rest",
        "upgradeable": false
      },
      {
        "value": "You have proficiency in the Nature skill. If you already have proficiency in Nature, you have expertise.",
        "comment": "prof -> expert -> advantage"
      },
      {
        "value": "You have proficiency in the Animal Handling skill. If you already have proficiency in Animal Handling, you have expertise.",
        "comment": "prof -> expert -> advantage"
      },
      {
        "value": "Beast and Plant creatures have disadvantage when attacking you",
        "upgradeable": false
      },
      {
        "value": "+1d4 poison melee thorns",
        "comment": "Die size"
      },
      {
        "value": "When you are hit, as a reaction, you may force the attacker to make a Constitution saving throw against a DC of 8 + your prof + your CON Mod. On a failed save, they are poisoned until the end of their turn.",
        "comment": "+1 DC"
      },
      {
        "value": "+4 poison damage resistance"
      },
      {
        "value": "+3 health regeneration per round of combat while outdoors"
      },
      {
        "value": "You may cast Healing Spirit as a 3rd level spell once per short rest",
        "comment": "+1 slot level"
      }
    ],
    "found": false,
    "level": 1
  },
  {
    "name": "Ketis' Dominion",
    "type": "weapon",
    "existing": [
      {
        "value": "You may choose to convert all physical damage from this weapon to cold, fire, or lightning damage.",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "Attacks with this weapon have advantage against targets that are vulnerable to cold, fire, or lightning damage.",
        "upgradeable": false
      },
      {
        "value": "+2 fire damage with attacks and spells, even if they don't deal fire damage already"
      },
      {
        "value": "+1d4 lightning damage to attacks and spells"
      },
      {
        "value": "-1 critical strike requirement with attacks that would deal cold damage"
      },
      {
        "value": "Once per long rest, when you take cold, fire, or lightning damage, you can use a reaction to immediately take a full turn",
        "comment": "+1 uses"
      },
      {
        "value": "+1 cold, fire, and lightning damage"
      },
      {
        "value": "You may cast Conjure Elemental as a 5th level spell once per long rest",
        "comment": "+1 spell slot level used"
      },
      {
        "value": "Your critical strikes with this weapon deal double the amount of cold, fire, and lightning damage",
        "upgradeable": false
      },
      {
        "value": "You become acclimatised to both hot and cold weather",
        "upgradeable": false
      }
    ],
    "found": false,
    "level": 1
  },
  {
    "name": "Esher's Health",
    "type": "armour",
    "existing": [
      {
        "value": "+3 health",
        "comment": "+2 health on level"
      },
      {
        "value": "You are immune to diseases",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+1 Constitution"
      },
      {
        "value": "+2 maximum hit dice",
        "comment": "+1"
      },
      {
        "value": "You have proficiency in the Medicine skill. If you already have proficiency in Medicine, you have expertise.",
        "comment": "prof -> expert -> advantage"
      },
      {
        "value": "+1 to death saves, -1 to death save critical requirement. You cannot get a critical failure with death saves.",
        "comment": "both +1 and -1"
      },
      {
        "value": "+3 to outgoing healing",
        "comment": "+2"
      },
      {
        "value": "+2 to incoming healing",
        "comment": "+1"
      },
      {
        "value": "You can cast Greater Restoration once per long rest"
      },
      {
        "value": "+1 resistance to all damage"
      },
      {
        "value": "If this mod gets to level 3, you gain the Tough feat. Current level: 1"
      }
    ],
    "found": false,
    "level": 1
  },
  {
    "name": "Jemima's Forgery",
    "type": "armour",
    "existing": [
      {
        "value": "+1 physical damage resistance"
      }
    ],
    "available": [
      {
        "value": "+1 AC if you have heavy armour proficiency"
      },
      {
        "value": "+1 physical damage"
      },
      {
        "value": "You may take an additional reaction if you received damage in the last round",
        "upgradeable": false
      },
      {
        "value": "-1 melee critical strike requirement"
      },
      {
        "value": "When hit by a melee attack, you can use a reaction to force the attacker to make a save against a DC of 8 + prof + your STR mod. On a failed save, their turn ends."
      },
      {
        "value": "When you block a melee attack, you can make a headbutt as a reaction. Deal 1+STR MOD bludgeoning damage.",
        "comment": "+1 damage"
      },
      {
        "value": "+1 Strength"
      },
      {
        "value": "You become proficient with heavy armour",
        "upgradeable": false
      },
      {
        "value": "You become proficient with martial weapons",
        "upgradeable": false
      }
    ],
    "found": false,
    "level": 1,
    "enabled": true
  },
  {
    "name": "Tea's Gratitude",
    "type": "armour",
    "existing": [
      {
        "value": "+2 damage with attacks against surprised targets",
        "comment": "Original"
      },
      {
        "value": "Once per short rest, you may disengage as a bonus action",
        "comment": "free action instead of bonus"
      }
    ],
    "available": [
      {
        "value": "You always have advantage on Stealth",
        "upgradeable": false
      },
      {
        "value": "You always have advantage on Sleight of Hand",
        "upgradeable": false
      },
      {
        "value": "+1 dexterity while wearing a stolen item (owner must be alive at time of theft)."
      },
      {
        "value": "You have expertise in deception when in regards to crimes you have committed.",
        "upgradeable": false
      },
      {
        "value": "+1d4 damage against flanked enemies"
      },
      {
        "value": "When rolling more than one mod on a magic item (crafting or finding double enchanted item), you may roll another mod and choose to ignore one",
        "upgradeable": false
      },
      {
        "value": "+1 to all dexterity skills and saves"
      },
      {
        "value": "You cannot be surprised",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 2,
    "enabled": true
  },
  {
    "name": "Erin's Infestation",
    "type": "armour",
    "existing": [
      {
        "value": "Once per short rest, as an action, you may cast Find Familiar, but the familiar must be a rat",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+3 animal handling",
        "comment": "+1"
      },
      {
        "value": "You have advantage on Wisdom (Perception) checks that rely on smell",
        "upgradeable": false
      },
      {
        "value": "If your current amulet is at least CR3, in addition to your regular amulet, you are always considered to be wearing an amulet that contains a Rat King (ToB 318). Using this is independent of your other amulet's uses.",
        "upgradeable": false
      },
      {
        "value": "+2 resistance to all damage while you have at least 3 allies within 60 feet of your, including minions (yours and other allies')",
        "comment": "player choice: +1 res or -1 ally requirement"
      },
      {
        "value": "You may cast Mirror Image once per short rest",
        "comment": "+1 uses"
      },
      {
        "value": "+5 resistance to poison damage",
        "comment": "+1"
      },
      {
        "value": "You can move freely through enemy spaces",
        "upgradeable": false
      },
      {
        "value": "+1 piercing damage"
      },
      {
        "value": "When you hit an enemy with an attack, they must make a save against a DC of 8 + that attack's AB. On a failed save, they gain one point of exhaustion. On a successful save, they become immune to future attempts at increasing their exhaustion in this way."
      }
    ],
    "found": false,
    "level": 1,
    "enabled": true
  },
  {
    "name": "Neldor's Treasure",
    "type": "ring",
    "existing": [
      {
        "value": "You may always ignore difficult terrain",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "Your movement cannot be reduced to 0 by non-magical effects (including grapple/restraint). Instead, it will remain at 5 feet.",
        "upgradeable": false
      },
      {
        "value": "When you find more than 1 of a crafting item, you find one additional item of that type",
        "upgradeable": false
      },
      {
        "value": "+1 to your saves when avoiding conditions",
        "upgradeable": false
      },
      {
        "value": "As a free action when learning about a creature, you may also learn one of its save bonuses",
        "upgradeable": false
      },
      {
        "value": "-1 save critical requirement (i.e. 20 -> 19)",
        "comment": "No more than 2 upgrades"
      },
      {
        "value": "Once per short rest, you can make a save to end a condition at the start of your turn instead of at the end",
        "comment": "More uses"
      },
      {
        "value": "If you upgrade or empower this mod, you gain one use of Legendary Resistance per long rest.",
        "comment": "Only upgradeable once"
      },
      {
        "value": "You can move at normal speed while prone"
      },
      {
        "value": "You gain 20 additional gold when finding gold from loot boxes",
        "comment": "+10"
      }
    ],
    "found": false,
    "level": 1,
    "enabled": false
  },
  {
    "name": "Naba's Power",
    "type": "weapon",
    "existing": [
      {
        "value": "You may convert any physical damage you deal with this weapon to lightning damage",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+1d6 lightning damage with attacks with this weapon",
        "comment": "Die size"
      },
      {
        "value": "+2 lightning damage",
        "comment": "+1"
      },
      {
        "value": "+1 to the DC of spells and cantrips that would deal lightning damage"
      },
      {
        "value": "You may ignore lightning resistance",
        "comment": "res + immunity on upgrade"
      },
      {
        "value": "You become resistant to lightning damage",
        "upgradeable": false
      },
      {
        "value": "When you score a critical strike with this weapon, the target must succeed a CON save against a DC of half the lightning damage dealt or be stunned for 1 minute (repeat save at end of turns).",
        "comment": "+1 DC"
      },
      {
        "value": "You can cast call lightning once per long rest. Mental mod of your choice.",
        "comment": "+1 uses"
      },
      {
        "value": "Once per short rest, when you land a killing blow with this weapon, you may force creatures within 5 feet of the target to make a save against 8 + the AB for that attack. On a failed save, they are stunned until the end of your next turn.",
        "comment": "+1 uses"
      },
      {
        "value": "Once per long rest, as a reaction to being hit by a creature within 60 feet from you, you may target them with the effects Lightning Lure (i.e. they are guaranteed to fail the save)."
      }
    ],
    "found": false,
    "level": 1,
    "enabled": false
  },
  {
    "name": "Template",
    "type": "weapon/armour",
    "existing": [
      {
        "value": "effect",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "upgradeableEffect"
      }
    ],
    "found": false,
    "level": 1,
    "enabled": false
  }
]
