[
  {
    "value": "Rheztol",
    "progress": 0,
    "levels": [
      "You learn the Minor Illusion cantrip. This does not count towards your limit of known cantrips. The spellcasting modifier can be a mental attribute of your choice.",
      "You have expertise in Investigation when identifying illusions.",
      "You become proficient in Deception. If you area already proficient, gain +2 deception instead.",
      "You become proficient in Persuation. If you area already proficient, gain +2 persuasion instead. You may choose to use persuasion instead of deception when communicating something true in a misleading way.",
      "+1 to the DCs of Illusion spells",
      "Creatures that currently believe one of your illusions are real have disadvantage when attacking you",
      "When casting non-cantrip Illusion spells, you may choose to use the spell slot level below that spell's natural casting requirement, to a minimum of 1",
      "When making Insight checks to analyse a person's statement(s), you may also make a Deception to detect they are lying/concealing information, but not to attempt to understand motivations",
      "You may cast Zone of Truth once per short rest. When cast in this way, the spell is centered on you and lasts for 1 hour.",
      "You have 30 feet of Truesight"
    ],
    "owner": "Test User 1"
  },
  {
    "value": "Esher",
    "progress": 0,
    "levels": [],
    "owner": "Test User 1"
  },
  {
    "value": "Ateus",
    "progress": 0,
    "levels": [
      "-1 critical requirement on all skill checks",
      "You have expertise in Persuasion when negotiating prices",
      "When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll",
      "20% increased gold gained from loot rolls",
      "You have advantage on the amount of loot you get from currency items, consumables, and gold",
      "As an action, you may cast the Fabricate spell once per short rest",
      "When you roll for a loot roll and get above a 2, you may choose to roll 1d8 to replace your result. You must then accept this result.",
      "You may destroy item to immediately gain base sale value.",
      "Relics attuned to you can be levelled for 50% of their usual levelling cost. Relics levelled beyond level 3 in this way have a base value of 150 (instead of 300).",
      "Whenever you make a skill check, you may also roll a d12 and use the higher of the scores"
    ]
  },
  {
    "value": "Vimis",
    "progress": 0,
    "levels": []
  },
  {
    "value": "Vuneta",
    "progress": 0,
    "levels": []
  },
  {
    "value": "Zetnos",
    "progress": 0,
    "levels": []
  },
  {
    "value": "Omnos",
    "progress": 0,
    "levels": []
  },
  {
    "value": "Odi",
    "progress": 0,
    "levels": ["",
      "",
      "",
      "",
      "You may cast Soul Cage once per long rest, but you may only use the Query Soul option"]
  },
  {
    "value": "Thetia",
    "progress": 0,
    "levels": []
  },
  {
    "value": "Cerasil",
    "progress": 0,
    "levels": []
  },
  {
    "value": "Qhanas",
    "progress": 0,
    "levels": []
  },
  {
    "value": "Idas",
    "progress": 0,
    "levels": []
  },
  {
    "value": "Ketis",
    "progress": 0,
    "levels": []
  }
]
